In [1]:
import pandas as pd 
import numpy as np
import statistics as st

In [2]:
df=pd.read_csv("Test.csv")

In [3]:
df

    Age  Income
0    30   40959
1    25   37412
2    33   70071
3    25   22451
4    27   22252
5    34   77004
6    33   23836
7    25   31468
8    37   24328
9    34   48286
10   26   72181
11   30   58774
12   35   35095
13   31   75595
14   33   72066
15   30   57275
16   38   72029
17   25   30164
18   33   62031
19   29   45023
20   30   74351
21   34   45361
22   29   75650
23   34   70615
24   31   63887
25   33   32492
26   27   28861
27   25   21251
28   36   22427
29   32   49197

In [4]:
print(df.shape)

(30, 2)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     30 non-null     int64
 1   Income  30 non-null     int64
dtypes: int64(2)
memory usage: 608.0 bytes

In [6]:
df.mean()

Age          30.8
Income    48746.4
dtype: float64

In [7]:
df.loc[:,'Age'].mean()

30.8

In [8]:
df.loc[:'Income'].mean()

Age          30.8
Income    48746.4
dtype: float64

In [9]:
df.mean(axis = 1)[0:10]

0    20494.5
1    18718.5
2    35052.0
3    11238.0
4    11139.5
5    38519.0
6    11934.5
7    15746.5
8    12182.5
9    24160.0
dtype: float64

In [11]:
df.median()

Age          31.0
Income    46823.5
dtype: float64

In [14]:
df.loc[:,'Age'].median()

31.0

In [15]:
df.loc[:,'Income'].median()

46823.5

In [16]:
df.median(axis=1)[0:10]

0    20494.5
1    18718.5
2    35052.0
3    11238.0
4    11139.5
5    38519.0
6    11934.5
7    15746.5
8    12182.5
9    24160.0
dtype: float64

In [18]:
df.mode(axis=1)

     0      1
0   30  40959
1   25  37412
2   33  70071
3   25  22451
4   27  22252
5   34  77004
6   33  23836
7   25  31468
8   37  24328
9   34  48286
10  26  72181
11  30  58774
12  35  35095
13  31  75595
14  33  72066
15  30  57275
16  38  72029
17  25  30164
18  33  62031
19  29  45023
20  30  74351
21  34  45361
22  29  75650
23  34  70615
24  31  63887
25  33  32492
26  27  28861
27  25  21251
28  36  22427
29  32  49197

In [19]:
df.std()

Age           3.854241
Income    20179.689288
dtype: float64

In [21]:
df.loc[:,'Age'].std()

3.8542408349496147

In [22]:
df.loc[:,'Income'].std()

20179.689288131205

In [23]:
df.var()

Age       1.485517e+01
Income    4.072199e+08
dtype: float64

In [24]:
df.skew()

Age      -0.127301
Income    0.044227
dtype: float64

In [26]:
df.describe()

             Age        Income
count  30.000000     30.000000
mean   30.800000  48746.400000
std     3.854241  20179.689288
min    25.000000  21251.000000
25%    27.500000  30490.000000
50%    31.000000  46823.500000
75%    33.750000  70479.000000
max    38.000000  77004.000000

In [27]:
df.describe(include='all')

             Age        Income
count  30.000000     30.000000
mean   30.800000  48746.400000
std     3.854241  20179.689288
min    25.000000  21251.000000
25%    27.500000  30490.000000
50%    31.000000  46823.500000
75%    33.750000  70479.000000
max    38.000000  77004.000000

# Part 2 
Write a Python program to display some basic statistical details like percentile, mean, standard

deviation etc. of the species of Iris-setosa', 'Iris-versicolor and 'Iris-versicolor of iris.csv dataset

In [30]:
import pandas as pd 
import numpy as np
import statistics as st

In [31]:
df=pd.read_csv("iris.csv")

In [32]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [38]:
print('Iris-setosa')

Iris-setosa

In [51]:
setosa=df['species']=='setosa'
print(df[setosa].describe())

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [40]:
print('\n versicolor')

 versicolor

In [50]:
setosa = df['species'] == 'versicolor'

In [46]:
print(df[versicolor].describe())

       sepal_length  sepal_width  petal_length  petal_width
count           0.0          0.0           0.0          0.0
mean            NaN          NaN           NaN          NaN
std             NaN          NaN           NaN          NaN
min             NaN          NaN           NaN          NaN
25%             NaN          NaN           NaN          NaN
50%             NaN          NaN           NaN          NaN
75%             NaN          NaN           NaN          NaN
max             NaN          NaN           NaN          NaN

In [48]:
print('\nIris-virginica')
setosa = df['species'] == 'virginica'
print(df[setosa].describe())

Iris-virginica
       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000